---
kind: method
id: M:Autodesk.Revit.DB.SATImportOptions.#ctor(Autodesk.Revit.DB.SATImportOptions)
source: html/66b5296e-7bfb-c028-3214-6fb99499fd40.htm
---
# Autodesk.Revit.DB.SATImportOptions.#ctor Method

Constructs a new instance of SATImportOptions as a copy of the import options.

## Syntax (C#)
```csharp
public SATImportOptions(
	SATImportOptions option
)
```

## Parameters
- **option** (`Autodesk.Revit.DB.SATImportOptions`) - The SAT options to be copied.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null